dtusat-gym/app/controllers/observations_controller.rb

	def index
		@observations = if admin? || params[:filter] == 'all'
			Observation.all :order => 'created_at DESC'
---
SELECT * FROM "observations" WHERE ("observations".user_id = 2)

	def create
		@observation = Observation.new params[:observation]
		@observation.user_id = current_user.id unless admin?

		if @observation.save
---
INSERT INTO "observations" ("elevation", "latitude", "created_at", "beacon_recorded", "azimuth", "updated_at", "deleted_at", "time", "user_id", "longitude") VALUES('123', '23.342345', '2010-04-08 12:31:00', NULL, '234', '2010-04-08 12:31:00', NULL, '2010-04-08 12:24:00', 2, '53.123123')

	def edit
		@observation = Observation.find params[:id]
---
SELECT * FROM "observations" WHERE ("observations"."id" = 2)

	def update
		@observation = Observation.find params[:id]
		@observation.user_id = current_user.id unless admin?

		if @observation.update_attributes(params[:observation])
---
SELECT * FROM "observations" WHERE ("observations"."id" = 2)
UPDATE "observations" SET "updated_at" = '2010-04-08 13:20:23', "azimuth" = '798', "elevation" = '98asd' WHERE "id" = 7

	def destroy
		@observation = Observation.find params[:id]
		@observation.destroy
---
SELECT * FROM "observations" WHERE ("observations"."id" = 3)
DELETE FROM "observations" WHERE "id" = 3