dtusat-gym/app/controllers/users_controller.rb

	def index
		@users = User.all :order => 'username'
---
SELECT * FROM "users" ORDER BY username

	def create
		@user = User.new params[:user]
		if @user.save
---
INSERT INTO "users" ("position", "created_at", "updated_at", "username", "password", "email") VALUES('2.0 3.0 4.0 D', '2010-11-02 19:49:21', '2010-11-02 19:49:21', 'test', 'UEO0', '')

	def edit
		@user = User.find params[:id]
---
SELECT * FROM "users" WHERE ("users"."id" = 1)

	def update
		@user = User.find params[:id]
		if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "updated_at" = '2010-04-08 11:31:40', "longitude" = '53.123123', "latitude" = '23.34234' WHERE "id" = 2

	def destroy
		@user = User.find(params[:id])

		unless @user.username == 'admin'
			@user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 3